{"documents":["L: Actually the first time I thought about becoming a father was very early in my life. Probably I, I guess because of my upbringing—as I was brought up in Church and it was always a serious matter to me. I never went out with a girl without thinking that this is the girl I could possibly marry. Therefore, I always had it in my mind what it would be like. Well, I did not have strong views of what I would be like, what I had was knowing that I would be good toward the people I’d be dealing with. I did not know how I’d be that first time but I knew I would be a loving father. I did not have a picture of how I was going to be but I just knew I was going to be good toward the people . . . So . . .","AG: To me I would say it is very different. When I left my country and I came here in 1983, I was scared to become a father. As a Christian I was afraid not to meet the proper woman to become my wife in order to become a father. When I met my wife and realized that she was a Christian and looking behind at how my father raised us, I decided to become a father at that time. Fortunately, I had my father as an example I would say. He has been with my mother since I was little, and I would say he is still an example for me.","L: Mine would have been a combination of people. My father would definitely be one of those people because my father was a very good father. He is a guy who has justice; you cannot make him tremble in front of situations. He sits, analyzes, and comes to a conclusion. There are several pastors in my life I have come to admire, in the way some of them were. They also play a part, in that it is going to be a combina? tion of people. My father was the strongest role model, but he was not the only person who played the role.","J: I thought it was going to be an innovative experience. If I could say that, something you actually have the power to influence your personality in a very young mind to do some good. So I think it would be like being from a military background, creating a human being for the profit of society.","C: I could say the moment I met my wife, I thought about being a father. As my first girl friend, I thought eventually I would be married to her. To me it became obvious that I would be a father as a married person. I thought it was going to be a difficult job, a 24-hour job because there is no such thing as part-time fatherhood. I think it takes your whole being mentally and physically. Your presence in the house, in the home is very necessary at all times. My kids—they have it, God bless them they have it. I thought it was going to be a unique experience—you do not learn it in college or anywhere else.","C: Yes, yes when I think about the days of my youth I can see my father and his dedication. The love that he has shown, and his hard-working style and his honesty. All that left a serious imprint on me. My dream was to look like my father. Everybody saw in him a model. His credibility was something that everybody I would say envies, that type of person he was. They love him—people would give him money to save because they knew he would not spend it. So, I always thought that it would be in my best in? terest to be like him."],"codes":["Something about religion","Using one’s own father as a role model"],"documents_annotations":[{"document":0,"codes":[],"memo":"","annotation_update":"2023-01-02T05:33:24.275Z","annotation_user":"default_user"},{"document":2,"codes":[],"memo":"","annotation_update":"2023-01-02T05:34:53.453Z","annotation_user":"default_user"}],"fragments_annotations":[{"id":"l3ttn9p8","document":0,"text":"the first time I thought about becoming a father was very early in my life. Probably I, I guess because of my upbringing—as I was brought up in Church and it was always a serious matter to me. I never went out with a girl without thinking that this is the girl I could possibly marry.","start":12,"end":295,"codes":[0],"memo":"Being a father is a serious matter, because it is connected with being religious.","annotation_update":"2023-01-02T05:33:55.186Z","annotation_user":"default_user"},{"id":"5zfi0ja8","document":1,"text":"I was scared to become a father. As a Christian I was afraid not to meet the proper woman to become my wife in order to become a father. When I met my wife and realized that she was a Christian and looking behind at how my father raised us, I decided to become a father at that time.","start":92,"end":374,"codes":[0],"memo":"Fatherhood connected with religion","annotation_update":"2023-01-02T05:33:47.250Z","annotation_user":"default_user"},{"id":"0arcod8v","document":1,"text":"Fortunately, I had my father as an example I would say. He has been with my mother since I was little, and I would say he is still an example for me.","start":376,"end":524,"codes":[1],"memo":"One’s own father as a model to emulate","annotation_update":"2023-01-02T05:35:36.566Z","annotation_user":"default_user"},{"id":"2489nots","document":2,"text":"my father was a very good father. He is a guy who has justice; you cannot make him tremble in front of situations.","start":107,"end":220,"codes":[1],"memo":"Expresses his admiration for his father.","annotation_update":"2023-01-02T05:34:58.234Z","annotation_user":"default_user"},{"id":"o9d6cluw","document":4,"text":"To me it became obvious that I would be a father as a married person.","start":146,"end":214,"codes":[],"memo":"Being a father is the obvious and natural consequence of marriage","annotation_update":"2023-01-02T05:31:49.637Z","annotation_user":"default_user"},{"id":"cywladwy","document":5,"text":"Yes, yes when I think about the days of my youth I can see my father and his dedication. The love that he has shown, and his hard-working style and his honesty. All that left a serious imprint on me. My dream was to look like my father.","start":3,"end":238,"codes":[1],"memo":"C admires and desires to emulate his own father.","annotation_update":"2023-01-02T05:35:18.483Z","annotation_user":"default_user"}]}